<template>
  <div class="file-body">
    <div class="file-title">
      流浪动物救助平台认证协议
    </div>
    <div class="file-text">
      <p>
        流浪动物救助平台是一款旨在为全国动保人士搭建的一个公共平台，是全国动保人的联盟。感谢您选择流浪动物救助平台基地认证，您在使用本服务前请认真阅读以下协议（以下简称：本协议）。<br>
        一、基地认证协议的确认<br>1、请您先仔细阅读本协议内容，您通过页面点击或其他方式确认即表示您已充分阅读、理解并接受本协议的全部内容，并与流浪动物救助平台达成协议。<br>2、如我们对本协议进行修改，我们将通过www.iaiwei.cn网站公告的方式提前予以公布，变更后的协议在公告届满3日起生效。若您无法同意变更修改后的协议内容，您有权停止使用相关服务；若您继续使用或访问流浪动物救助平台则表示您同意本协议的修改。<br>3、如您为无民事行为能力人或为限制民事行为能力人，请告知您的监护人，并在您监护人的指导下阅读本协议和使用我们的服务。<br>二、基地认证相关定义<br>1、基地名称（或称“名称”）：指流浪动物救助基地的名称。<br>2、认养：流浪动物救助平台发起的网络认养宠物的项目,
        基地发布认养项目后宠友支付宠物认养月生活费，平台运营支持收取3%平台服务费。<br>3、支持:指流浪动物救助基地发布日常救助图文动态后,实时展示在互动版块,动保人士给予捐助支持救助行动。<br>4、筹粮:是流浪动物救助基地提供的筹粮服务，由流浪动物救助基地发起筹粮项目，动物爱好者在平台购买宠粮送给基地，平台以宠粮交付给基地。宠粮定价为12元/kg（包括了运费和平台服务费），筹粮达到20kg可申请提粮。<br>5、基地网站：指www.iaiwei.cn下基地主页及对应的微信公众号、微信小程序、QQ小程序、支付宝小程序。<br>三、基地为您提供的功能内容<br>通过基地认证，免费获得流浪动物救助基地官方主页（包括PC端、手机端、微信公众号、微信小程序、QQ小程序、支付宝小程序），可一站式管理基地日常事务，集成了基地介绍、基地活动、基地筹粮、基地认养、互动支持等功能。<br>提现说明：提现前须详细填写认证信息，包括收货地址和收款账号，等待审核通过后即可操作提现。<br>1.筹粮提现：用户筹粮重量大于20kg即可申请提现，提现数量系统自动计算20的整数倍千克数，剩余筹粮下次再提。筹粮提现额外不扣取平台服务费，按实际重量提现。<br>2.现金提现：现金提现包括了认养金额和捐助支持金额，金额大于100元即可申请提现，申请提现时平台将扣除相应服务费。<br>3.平台服务费及银行手续费：基地筹粮，为基地结算宠粮免额外收取平台服务费。基地捐助支持、宠物认养平台收取3%平台服务费（包含了微信、支付宝收取的结算费用）+10元银行转账费用。<br>四、基地名称和账户的注册、使用<br>（一）注册<br>1、您完成基地名称注册，填写基地相关信息介绍，正常使用账号，有不明白的问题还可以咨询客服。具体申请方式以流浪动物救助平台基地页面提示为准。<br>（二）使用<br>1、您一旦注册成功，便成为流浪动物救助平台的合法用户。<br>2、用户的密码和帐号遭到未授权的使用或发生其他任何安全问题，用户可以立即停止使用，并通知我们。<br>3、对于用户长时间未使用的帐号，流浪动物救助平台有权予以关闭。<br>五、用户权利和义务<br>1、用户有权利拥有自己在流浪动物救助平台的用户名及交易密码，并有权利使用自己的用户名及密码随时登陆流浪动物救助平台。用户不得以任何形式擅自转让或授权他人使用自己的流浪动物救助平台用户名。<br>2、用户有权根据本服务协议的规定以及流浪动物救助平台上发布的相关规则利用流浪动物救助平台平台查询物品信息、发布信息、登录、修改信息、与其它用户订立合同等参加流浪动物救助平台的有关活动以及有权享受流浪动物救助平台提供的其它的有关信息服务。<br>3、用户在流浪动物救助平台交易过程中如与其他用户因交易产生纠纷，可以请求流浪动物救助平台从中予以协调。用户如发现其他用户有违法或违反本服务协议的行为，可以向流浪动物救助平台进行反映要求处理。如用户因网上交易与其他用户产生诉讼的，用户有权通过司法部门要求流浪动物救助平台提供相关资料。<br>4、用户有义务在注册时提供自己的真实资料，并保证诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性及安全性，保证流浪动物救助平台及其他用户可以通过上述联系方式与自己进行联系。同时，用户也有义务在相关资料实际变更时及时更新有关注册资料。用户保证不以他人资料在流浪动物救助平台进行注册或认证。<br>5、用户应当保证在使用流浪动物救助平台网上平台使用过程中遵守诚实信用的原则，不采取不正当竞争行为，不扰乱流浪动物救助平台的正常秩序。<br>6、用户可在他们发表的信息中加入宣传资料或其他广告策划展示他们的产品。任何这类宣传方法，包括付款、服务、商业条件及与广告有关的描述都只是在相应的用户和客户之间发生。重庆微虎信息技术有限公司不承担任何责任，没有义务为这类广告宣传负任何一部分的责任。<br>六、使用基地认证时您承诺遵守以下约定<br>1、用户须对基地的注册信息的真实性、合法性、有效性承担全部责任，用户不得使用他人的名义发布任何信息；当被发现用户冒用他人或机构的名义恶意注册帐号，流浪动物救助平台有权立即停止提供服务，收回其帐号，账户内筹粮、认养、助养等不予结算，该用户承担由此而产生的一切法律及其他责任。<br>2、您应采取合理措施维护其密码和帐号的安全。用户对利用该密码和帐号所进行的一切活动负全部责任；由该活动所导致的任何损失或损害由用户承担，流浪动物救助平台不承担任何责任。<br>3、为了更好地向您提供服务，请您在使用流浪动物救助平台基地认证过程中，遵守本协议内容、流浪动物救助平台网站上出现的关于操作的提示及我们发送的通知。<br>4、流浪动物救助平台不对用户所发布信息的删除或储存失败承担责任。平台有权判断用户的行为是否符合本协议规定，如果用户被认为违背了协议条款规定，平台有终止向其提供网站服务的权利。<br>5、您发布的项目如果违规、被投诉严重、被认定欺诈。我们将不予提现，您基地的剩余筹粮，助养，认养费用将捐赠给爱微慈善服务中心用于流浪动物救助公益项目。<br>6、您理解，我们的服务有赖于系统的准确运行及操作。若出现系统差错、故障、您或我们不当获利等情形，您同意我们可以采取更正差错、扣划款项等适当纠正措施。<br>7、您不得对我们的系统和程序采取反向工程手段进行破解，不得对上述系统和程序（包括但不限于源程序、目标程序、技术文档、客户端至服务器端的数据、服务器数据）进行复制、修改、编译、整合或篡改，不得修改或增减我们系统的功能。<br>8、禁止用户发布以下内容：<br>（1）反对宪法所确定的基本原则的；<br>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br>（3）损害国家荣誉和利益的；<br>（4）煽动民族仇恨、民族歧视，破坏民族团结的；<br>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；<br>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；<br>（7）散布淫秽、赌博、暴力、凶杀、自残、恐怖或者教唆犯罪的；<br>（8）侮辱或者诽谤他人，侵害他人合法权益（如名誉权、肖像权等）的；<br>（9）侵害他人知识产权、商业秘密等合法权利的；<br>（10）虚构事实、隐瞒真相以误导、欺骗他人的；<br>（11）发布、传送、传播广告信息及垃圾信息的；<br>（12）其他法律法规禁止的行为。<br>如果您上传、发布或传输的内容含有以上违反法律法规的信息或内容，或者侵犯任何第三方的合法权益，您将直接承担以上导致的一切不利后果。<br>七、用户信息保护<br>我们重视对您信息的保护，关于您的个人信息，我们将依法保护您的商业秘密。未经您同意不会对外提供（除相关法律法规或法院、政府机关要求外）。
        <br>八、不可抗力、免责说明<br>（一）免责条款<br>因下列原因导致我们无法正常提供服务，我们免于承担责任：<br>1、我们的系统停机维护或升级；<br>2、因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；<br>3、您的电脑软硬件和通信线路、供电线路出现故障的；<br>4、因您操作不当或通过非经我们授权或认可的方式使用我们服务的；<br>5、因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、第三方服务瑕疵或政府行为等原因。<br>九、知识产权的保护<br>1、流浪动物救助平台网站上的内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由我们公司依法拥有知识产权，包括但不限于商标权、著作权、商业秘密等。<br>2、非经我们书面同意，请勿擅自使用、修改、反向编译、复制、公开传播、改变、散布、发行或公开发表流浪动物救助平台网站程序或内容。<br>3、尊重知识产权是您应尽的义务，如有违反，您需要承担损害赔偿责任。<br>十、无代理关系<br>您与流浪动物救助平台仅为独立订约人关系。本协议无意结成或创设任何代理、合伙、合营、雇用与被雇用或特许权授予与被授予关系。<br>十一、
        法律适用与管辖<br>本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本协议产生的争议，均应依照中华人民共和国法律予以处理，并由流浪动物救助平台所地人民法院管辖。<br>十二、其他<br>1、本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。<br>2、本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。本协议最终解释权归重庆微虎信息技术有限公司所有。<br>3、本协议自认证申请日生效。<br>4、附:定向援助协议<br>
      </p>

    </div>
  </div>
</template>

<script>
export default {
  name: "index",
  mounted() {
    document.getElementsByClassName("main-container")[0].style['background-color'] = '#f3f3f3'
  },
  destroyed() {
    document.getElementsByClassName("main-container")[0].style['background-color'] = '#ffffff'
  }
}
</script>

<style scoped lang="scss">
.file-body {
  background-color: white;
  padding: 3em;

  .file-title {
    font-size: 2em;
    text-align: center;
  }

  .file-text {
    color: #5a5e66;
    line-height: 2em;
  }
}
</style>
