<template>
  <div class="file-body">
    <div class="file-title">
      《中华人民共和国动物防疫法》
    </div>
    <div class="file-text">
      <br>第十四条 经强制免疫的动物，应当按照国务院兽医主管部门的规定建立免疫档案，施畜禽标识，实施可追溯管理。
      <br>第二十五条 禁止屠宰、经营、运输下列动物和生产、经营、加工、贮藏、运输下列动物产品：
      <br>（一）封锁疫区内与所发生动物疫病有关的；
      <br>（二）疫区内易感染的；
      <br>（三）依法应当检疫而未经检疫或者检疫不合格的；
      <br>（四）染疫或者疑似染疫的；
      <br>（五）病死或者死因不明的；
      <br>（六）其他不符合国务院兽医主管部门有关动物防疫规定的。
      <br>第四十二条 屠宰、出售或者运输动物以及出售或者运输动物产品前，货主应当按照国务院兽医主管部门的规定向当地动物卫生监督机构申报检疫。
      动物卫生监督机构接到检疫申报后，应当及时指派官方兽医对动物、动物产品实施现场检疫；检疫合格的，出具检疫证明、加施检疫标志。实施现场检疫的官方兽医应当在检疫证明、检疫标志上签字或者盖章，并对检疫结论负责。
      <br>第四十三条 屠宰、经营、运输以及参加展览、演出和比赛的动物，应当附有检疫证明；经营和运输的动物产品，应当附有检疫证明、检疫标志。
      对前款规定的动物、动物产品，动物卫生监督机构可以查验检疫证明、检疫标志，进行监督抽查，但不得重复检疫收费。
      <br>第四十四条 经铁路、公路、水路、航空运输动物和动物产品的，托运人托运时应当提供检疫证明；没有检疫证明的，承运人不得承运。
      运载工具在装载前和卸载后应当及时清洗、消毒。
      <br>第五十九条 动物卫生监督机构执行监督检查任务，可以采取下列措施，有关单位和个人不得拒绝或者阻碍：
      <br>（一）对动物、动物产品按照规定采样、留验、抽检；
      <br>（二）对染疫或者疑似染疫的动物、动物产品及相关物品进行隔离、查封、扣押和处理；
      <br>（三）对依法应当检疫而未经检疫的动物实施补检；
      <br>（四）对依法应当检疫而未经检疫的动物产品，具备补检条件的实施补检，不具备补检条件的予以没收销毁；
      <br>（五）查验检疫证明、检疫标志和畜禽标识；
      <br>（六）进入有关场所调查取证，查阅、复制与动物防疫有关的资料。
      <br>动物卫生监督机构根据动物疫病预防、控制需要，经当地县级以上地方人民政府批准，可以在车站、港口、机场等相关场所派驻官方兽医。
      <br>第九章 法律责任
      <br>第六十八条 地方各级人民政府及其工作人员未依照本法规定履行职责的，对直接负责的主管人员和其他直接责任人员依法给予处分。
      <br>第六十九条 县级以上人民政府兽医主管部门及其工作人员违反本法规定，有下列行为之一的，由本级人民政府责令改正，通报批评；对直接负责的主管人员和其他直接责任人员依法给予处分：
      <br>（一）未及时采取预防、控制、扑灭等措施的；
      <br>（二）对不符合条件的颁发动物防疫条件合格证、动物诊疗许可证，或者对符合条件的拒不颁发动物防疫条件合格证、动物诊疗许可证的；
      <br>（三）其他未依照本法规定履行职责的行为。
      <br>第七十条 动物卫生监督机构及其工作人员违反本法规定，有下列行为之一的，由本级人民政府或者兽医主管部门责令改正，通报批评；对直接负责的主管人员和其他直接责任人员依法给予处分：
      <br>（一）对未经现场检疫或者检疫不合格的动物、动物产品出具检疫证明、加施检疫标志，或者对检疫合格的动物、动物产品拒不出具检疫证明、加施检疫标志的；
      <br>（二）对附有检疫证明、检疫标志的动物、动物产品重复检疫的；
      <br>（三）从事与动物防疫有关的经营性活动，或者在国务院财政部门、物价主管部门规定外加收费用、重复收费的；
      <br>（四）其他未依照本法规定履行职责的行为。
      <br>第七十一条 动物疫病预防控制机构及其工作人员违反本法规定，有下列行为之一的，由本级人民政府或者兽医主管部门责令改正，通报批评；对直接负责的主管人员和其他直接责任人员依法给予处分：
      <br>（一）未履行动物疫病监测、检测职责或者伪造监测、检测结果的；
      <br>（二）发生动物疫情时未及时进行诊断、调查的；
      <br>（三）其他未依照本法规定履行职责的行为。
      <br>第七十六条
      违反本法第二十五条规定，屠宰、经营、运输动物或者生产、经营、加工、贮藏、运输动物产品的，由动物卫生监督机构责令改正、采取补救措施，没收违法所得和动物、动物产品，并处同类检疫合格动物、动物产品货值金额一倍以上五倍以下罚款；其中依法应当检疫而未检疫的，依照本法第七十八条的规定处罚。（第二十五条
      禁止屠宰、经营、运输下列动物和生产、经营、加工、贮藏、运输下列动物产品：
      <br>（一）封锁疫区内与所发生动物疫病有关的；
      <br>（二）疫区内易感染的；
      <br>（三）依法应当检疫而未经检疫或者检疫不合格的；
      <br>（四）染疫或者疑似染疫的；
      <br>（五）病死或者死因不明的；
      <br>（六）其他不符合国务院兽医主管部门有关动物防疫规定的。）
      <br>第七十八条
      违反本法规定，屠宰、经营、运输的动物未附有检疫证明，经营和运输的动物产品未附有检疫证明、检疫标志的，由动物卫生监督机构责令改正，处同类检疫合格动物、动物产品货值金额百分之十以上百分之五十以下罚款；对货主以外的承运人处运输费用一倍以上三倍以下罚款。
      违反本法规定，参加展览、演出和比赛的动物未附有检疫证明的，由动物卫生监督机构责令改正，处一千元以上三千元以下罚款。
      <br>第七十九条 违反本法规定，转让、伪造或者变造检疫证明、检疫标志或者畜禽标识的，由动物卫生监督机构没收违法所得，收缴检疫证明、检疫标志或者畜禽标识，并处三千元以上三万元以下罚款。
    </div>
  </div>
</template>

<script>
export default {
  name: "policy",
  mounted() {
    document.getElementsByClassName("main-container")[0].style['background-color'] = '#f3f3f3'
  },
  destroyed() {
    document.getElementsByClassName("main-container")[0].style['background-color'] = '#ffffff'
  }
}
</script>

<style scoped lang="scss">
.file-body {
  background-color: white;
  padding: 3em;

  .file-title {
    font-size: 2em;
    text-align: center;
  }

  .file-text {
    color: #5a5e66;
    line-height: 2em;
  }
}

#text_content {
  width: 100%;
  border: none;
  background: none !important;
}

textarea {
  resize: none;
  outline: none;
}
</style>
