<template>
  <div class="file-body">
    <div class="file-title">
      流浪动物救助平台用户服务协议
    </div>
    <div class="file-text">
      <p>
        欢迎你使用流浪动物救助平台及服务！<br>为使用流浪动物救助平台（以下简称“本网站”）及服务，你应当阅读并遵守《流浪动物救助平台用户服务协议》（以下简称“本协议”）。请你务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。限制、免责条款可能以加粗形式提示你注意。<br>除非你已阅读并接受本协议所有条款，否则你无权使用本网站及相关服务。你的使用、获取微信帐号、登录等行为即视为你已阅读并同意上述协议的约束。<br>一、协议的范围<br>1.1 协议适用主体范围<br>本协议是你与流浪动物救助平台之间关于你使用本网站相关服务所订立的协议。<br>二、关于本协议<br>2.1本协议的形式<br>2.1.1 你进入流浪动物救助平台即表示您同意自己已经与流浪动物救助平台订立本协议，且您将受本协议的条款和条件约束。<br>2.1.2流浪动物救助平台可全权决定更改“条款”。如“条款”有任何变更，流浪动物救助平台在其网站上发布公告，通知予你。经修订的“条款”一经在流浪动物救助平台公布后，立即自动生效。你应在登录后仔细阅读修订后的“条款”，如不同意相关变更，有权选择停止使用“服务”。一旦继续使用“服务”，则表示你已接受经修订的“条款”。<br>2.1.3如果你与流浪动物救助平台发生争议时，一切以最新的用户服务协议为准。除另行明确声明外，任何使“服务”范围扩大或功能增强的新内容均受本协议约束。<br>2.2 本协议许可的范围<br>2.2.1 流浪动物救助平台给予用户一项个人的、不可转让及非排他性的许可，以使用本网站。本网站仅供能够根据相关法律规定的有完全民事行为能力的人（自然人或单位和个人）服务。<br>三、网站的更新<br>3.1 为了改善用户体验、完善服务内容，流浪动物救助平台将不断努力开发新的服务，并为用户不时提供网站更新（这些更新可能会采取网站替换、修改、功能强化、版本升级等形式）。<br>3.2 为了保证本网站及服务的安全性和功能的一致性，流浪动物救助平台有权不经向用户特别通知而对网站进行更新，或者对网站的部分功能效果进行改变或限制。<br>四、用户个人信息保护<br>4.1 保护用户信息是流浪动物救助平台的一项基本原则，流浪动物救助平台将会采取合理的措施保护用户的信息。除法律法规规定的情形外，未经用户许可流浪动物救助平台不会向第三方公开、透露用户个人信息。流浪动物救助平台对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。<br>4.2 用户在登录帐号或使用本网站的过程中，需要提供一些必要的信息，例如：登录网站需要你填写手机号码，若你提供的信息不完整，则无法使用本服务或在使用过程中受到限制。<br>4.3 未经用户的同意，流浪动物救助平台不会向流浪动物救助平台以外的任何公司、组织和个人披露你的个人信息，但法律法规另有规定的除外。<br>五、主权利义务条款<br>5.1 帐号使用规范<br>5.1.1 你在使用本服务前需要注册一个帐号。帐号可通过手机号码进行注册。<br>5.1.2如你代表个人或其他法律主体在流浪动物救助平台登记，需要你声明和保证，你有权使个人或其他法律主体接受本协议“条款”约束。<br>5.1.3 用户有责任妥善保管注册帐户信息及帐户密码的安全，用户需要对注册帐户以及密码的行为承担法律责任。用户同意在任何情况下不向他人透露帐户及密码信息。如发现任何人未经授权使用你的账户，或发生违反保密规定的任何其他情况，你应立即通知流浪动物救助平台，<br>5.1.4为了确保你的信息安全，请在上网时段结束时，以正确步骤离开网站。流浪动物救助平台不会因你未能遵守规定而发生的任何损失或损毁负责。<br>6.2 用户注意事项<br>6.2.1 用户理解并同意：你在使用本网站某一特定服务时，该服务可能会另有单独的协议、相关业务规则等，使用前阅读并接受相关单独协议和业务规则，即视为你接受述前协议。<br>6.2.2 理解并同意流浪动物救助平台将会尽其商业上的合理努力保障你在本网站的数据存储安全，但是，流浪动物救助平台并不能就此提供完全保证，包括但不限于以下情形：<br>6.2.2.1 流浪动物救助平台不对你在本网站及服务中相关数据的删除或储存失败负责；<br>6.2.2.2 流浪动物救助平台有权根据实际情况自行决定在本网站中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。你可根据自己的需要自行备份本网站中的相关数据；<br>6.2.2.3 如果你停止使用本网站及服务或服务被终止或取消，流浪动物救助平台可以从服务器上永久地删除你的数据。服务停止、终止或取消后，流浪动物救助平台没有义务向你返还任何数据。<br>6.2.3  你在使用本网站及服务时，须自行承担如下来自流浪动物救助平台不可掌控的风险内容，包括但不限于：<br>6.2.3.1由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险；<br>6.2.3.2你在使用本软件访问第三方网站时，因第三方网站及相关内容所可能导致的风险，由用户自行承担；<br>6.2.3.3你发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；<br>6.2.3.4由于网络信号不稳定、网络带宽小等网络原因，所引起的网站登录失败、资料同步不完整、页面打开速度慢等风险。<br>七、用户行为规范<br>7.1 信息内容规范<br>7.1.1 本条所述信息内容是指用户使用本网站及服务过程中所制作、复制、发布、传播的任何内容，包括但不限于微信帐号头像、名字、二维码、用户说明等注册信息，以及其他使用帐号或本网站及服务所产生的内容。<br>7.1.2 你理解并同意，流浪动物救助平台一直致力于为用户提供文明健康、规范有序的网络环境，你不得利用本网站及服务制作、复制、发布、传播如下干扰流浪动物救助平台正常运营，以及侵犯其他用户或第三方合法权益的内容，包括但不限于：<br>7.1.2.1 发布、传送、传播、储存违反国家法律法规禁止的内容：<br>（1）违反宪法确定的基本原则的；<br>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br>（3）损害国家荣誉和利益的；<br>（4）煽动民族仇恨、民族歧视，破坏民族团结的；<br>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；<br>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；<br>（7）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；<br>（7）侮辱或者诽谤他人，侵害他人合法权益的；<br>（9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；<br>（10）以非法民间组织名义活动的；<br>（11）不符合《即时通信工具公众信息服务发展管理暂行规定》及遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的；<br>（12）含有法律、行政法规禁止的其他内容的。<br>7.1.2.2 发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；<br>7.1.2.3 涉及他人隐私、个人信息或资料的；<br>7.1.2.4 发表、传送、传播骚扰信息及垃圾信息或含有任何性或性暗示的；<br>7.1.2.5 其他违反法律法规、政策及公序良俗、社会公德和侵犯其他用户合法权益内容的信息。<br>7.2 网站使用规范<br>7.2.1 除非法律允许，你使用本网站过程中不得从事下列行为：<br>7.2.1.1 删除本网站上关于著作权的信息；<br>7.2.1.2 对本网站进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本网站的源代码；<br>7.2.1.3 自行或者授权他人、第三方网站对本网站及其组件、模块、数据进行干扰；<br>7.2.1.4 其他未经流浪动物救助平台明示授权的行为。<br>7.2.2用户资料规范<br>7.2.2.1. 不会有欺诈成份，并与伪造或盗窃无涉；<br>7.2.2.2不会侵犯任何第三者享有的物权、版权、专利、商标、商业秘密或其他知识产权，或隐私权、名誉权；<br>7.2.2.3不会违反任何法律、法规、条例或规章；<br>7.2.2.4不会含有诽谤（包括商业诽谤）、非法恐吓或非法骚扰的内容；<br>7.2.2.5不会含有淫秽、或包含任何儿童色情内容；<br>7.2.2.6不会含有蓄意毁坏、恶意干扰、秘密地截取或侵占任何系统、数据或个人资料的任何病毒、伪装破坏程序、电脑蠕虫、定时程序炸弹或其他电脑程序；<br>7.3 对自己行为负责<br>用户充分理解并同意，用户必须为自己注册帐号下的一切行为负责，包括你所发表的任何内容以及由此产生的任何后果。你应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。流浪动物救助平台无法且不会对因前述风险而导致的任何损失或损害承担责任。<br>7.4 违约处理<br>7.4.1 如果流浪动物救助平台发现或收到他人举报或投诉用户违反本协议约定的，流浪动物救助平台有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁直至注销的处罚，并公告处理结果。<br>7.4.2 用户理解并同意，流浪动物救助平台有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。<br>7.4.3 用户理解并同意，因违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，用户应当独立承担责任；流浪动物救助平台因此遭受损失的，用户也应当一并赔偿。<br>八、知识产权声明<br>8.1本网站的一切著作权、商标权、商业秘密等知识产权，以及与本网站相关的所有信息内容（包括但不限于文字、图片、图表、界面设计、版面框架、有关数据等）均受中华人民共和国法律法规和相应的国际条约保护，流浪动物救助平台享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。<br>8.2 未经流浪动物救助平台或相关权利人书面同意，用户不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。<br>九、终端安全责任<br>9.1 用户理解并同意，本网站同大多数互联网网站一样，可能会受多种因素影响，包括用户原因、网络服务质量等；也可能会受各种安全问题的侵扰，包括他人非法利用用户资料，进行现实中的骚扰；继而影响本网站的正常使用等。因此，用户应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。<br>9.2在适用法律允许的范围内，流浪动物救助平台在任何情况下（不论何种原因）均不承担如下责任：（A）任何间接的、故意的、惩罚性的、附带的、惩戒性的、特殊的或后果性的损害赔偿; （B）业务或机会损失; （C）收入损失; （D）利润损失; （E）商誉损失;（F）内容损失; 或（G）数据丢失。<br>9.3 维护网站安全与正常使用是流浪动物救助平台和你的共同责任，流浪动物救助平台将按照行业标准合理审慎地采取必要技术措施保护你的终端设备信息和数据安全，但是你承认和同意流浪动物救助平台并不能就此提供完全保证。<br>9.4 在任何情况下，用户不应轻信索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意流浪动物救助平台有关防范诈骗犯罪的提示。<br>十. 无代理关系<br>用户与流浪动物救助平台仅为独立订约关系。本协议无意结成或创设任何代理、合伙、合营、雇用与被雇用或特许权授予与被授予关系。<br>十一. 广告和金融服务<br>11.1用户同意流浪动物救助平台可以自行或由第三方通过短信、电子邮件或电子信息等多种方式向您发送、展示广告或其他信息（包括商业与非商业信息），广告或其他信息的具体发送及展示形式、频次及内容等以流浪动物救助平台实际提供为准。<br>11.2 流浪动物救助平台将依照相关法律法规要求开展广告业务。用户同意，对本服务中出现的广告，用户应审慎判断其真实性和可靠性，除法律明确规定外，用户应对因该广告而实施的行为负责。<br>十二. 转让<br>流浪动物救助平台转让本协议无需经用户同意。<br>十三.其他<br>12.1 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。<br>12.2 若用户和流浪动物救助平台之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，用户同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。<br>12.3 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。<br>12.4 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。<br>
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: "user",
  mounted() {
    document.getElementsByClassName("main-container")[0].style['background-color'] = '#f3f3f3'
  },
  destroyed() {
    document.getElementsByClassName("main-container")[0].style['background-color'] = '#ffffff'
  }
}
</script>

<style scoped lang="scss">
.file-body {
  background-color: white;
  padding: 3em;

  .file-title {
    font-size: 2em;
    text-align: center;
  }

  .file-text {
    color: #5a5e66;
    line-height: 2em;
  }
}
</style>
